NextFOAM-2606/tutorials/mesh/createPatch/multiRegionHeater_autoPatch/0.orig/topAir/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/topAir";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    maxY
    {
        type            noSlip;
    }
    minX
    {
        type            uniformFixedValue;
        uniformValue    ( 0.1 0 0 );
    }
    maxX
    {
        type            inletOutlet;
        value           uniform ( 0.1 0 0 );
        inletValue      uniform ( 0 0 0 );
    }
    minZ
    {
        type            noSlip;
    }
    maxZ
    {
        type            noSlip;
    }
    group_solid
    {
        type            noSlip;
    }
    group_fluid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
